Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK0512GPD100.atdf
         <register caption="ADC Early Interrupt Status Register 2" name="ADCEISTAT2" offset="0x3f0" rw="RW" size="4">
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000002" name="EIRDY33" values="ADCEISTAT2__EIRDY33" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000004" name="EIRDY34" values="ADCEISTAT2__EIRDY34" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000008" name="EIRDY35" values="ADCEISTAT2__EIRDY35" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000010" name="EIRDY36" values="ADCEISTAT2__EIRDY36" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000020" name="EIRDY37" values="ADCEISTAT2__EIRDY37" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000040" name="EIRDY38" values="ADCEISTAT2__EIRDY38" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000080" name="EIRDY39" values="ADCEISTAT2__EIRDY39" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000100" name="EIRDY40" values="ADCEISTAT2__EIRDY40" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00000200" name="EIRDY41" values="ADCEISTAT2__EIRDY41" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00002000" name="EIRDY45" values="ADCEISTAT2__EIRDY45" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00004000" name="EIRDY46" values="ADCEISTAT2__EIRDY46" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00008000" name="EIRDY47" values="ADCEISTAT2__EIRDY47" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00010000" name="EIRDY48" values="ADCEISTAT2__EIRDY48" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00020000" name="EIRDY49" values="ADCEISTAT2__EIRDY49" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00040000" name="EIRDY50" values="ADCEISTAT2__EIRDY50" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00080000" name="EIRDY51" values="ADCEISTAT2__EIRDY51" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00100000" name="EIRDY52" values="ADCEISTAT2__EIRDY52" />
            <bitfield caption="Early Interrupt for Corresponding Analog Input Ready bits" mask="0x00200000" name="EIRDY53" values="ADCEISTAT2__EIRDY53" />
         </register>
         <register caption="ADC Analog Warm-up Control Register" name="ADCANCON" offset="0x400" rw="RW" size="4">
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000001" name="ANEN0" values="ADCANCON__ANEN0" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000002" name="ANEN1" values="ADCANCON__ANEN1" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000004" name="ANEN2" values="ADCANCON__ANEN2" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000008" name="ANEN3" values="ADCANCON__ANEN3" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000010" name="ANEN4" values="ADCANCON__ANEN4" />
            <bitfield caption="ADC Analog and Bias Circuitry Enable bits" mask="0x00000020" name="ANEN5" values="ADCANCON__ANEN5" />
            <bitfield caption="Shared ADC Analog and Bias Circuitry Enable bit" mask="0x00000080" name="ANEN7" values="ADCANCON__ANEN7" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000100" name="WKRDY0" values="ADCANCON__WKRDY0" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000200" name="WKRDY1" values="ADCANCON__WKRDY1" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000400" name="WKRDY2" values="ADCANCON__WKRDY2" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00000800" name="WKRDY3" values="ADCANCON__WKRDY3" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00001000" name="WKRDY4" values="ADCANCON__WKRDY4" />
            <bitfield caption="ADC5-ADC0 Wake-up Status bit" mask="0x00002000" name="WKRDY5" values="ADCANCON__WKRDY5" />
            <bitfield caption="Shared ADC Wake-up Status bit" mask="0x00008000" name="WKRDY7" values="ADCANCON__WKRDY7" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00010000" name="WKIEN0" values="ADCANCON__WKIEN0" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00020000" name="WKIEN1" values="ADCANCON__WKIEN1" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00040000" name="WKIEN2" values="ADCANCON__WKIEN2" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00080000" name="WKIEN3" values="ADCANCON__WKIEN3" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00100000" name="WKIEN4" values="ADCANCON__WKIEN4" />
            <bitfield caption="ADC Wake-up Interrupt Enable bit" mask="0x00200000" name="WKIEN5" values="ADCANCON__WKIEN5" />
            <bitfield caption="Shared ADC Wake-up Interrupt Enable bit" mask="0x00800000" name="WKIEN7" values="ADCANCON__WKIEN7" />
            <bitfield caption="Wake-up Clock Count bits" mask="0x0F000000" name="WKUPCLKCNT" values="ADCANCON__WKUPCLKCNT" />
         </register>
         <register caption="ADC0 Configuration Register" name="ADC0CFG" offset="0xd00" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADCCFG" />
         </register>
