Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK0512GPD100.atdf
         <register caption="Input Capture x Control Register" name="IC15CON" offset="0x21c00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC15CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC15CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC15CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC15CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC15CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC15CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC15CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC15CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC15CON__ON" />
         </register>
         <register caption="Input Capture x Control Register" name="IC16CON" offset="0x21e00" rw="RW" size="4">
            <bitfield caption="Input Capture Mode Select bits" mask="0x00000007" name="ICM" values="IC16CON__ICM" />
            <bitfield caption="Input Capture Buffer Not Empty Status bit" mask="0x00000008" name="ICBNE" values="IC16CON__ICBNE" />
            <bitfield caption="Input Capture Overflow Status Flag bit" mask="0x00000010" name="ICOV" values="IC16CON__ICOV" />
            <bitfield caption="Interrupt Control bits" mask="0x00000060" name="ICI" values="IC16CON__ICI"/>
            <bitfield caption="Timer Select bit" mask="0x00000080" name="ICTMR" values="IC16CON__ICTMR" />
            <bitfield caption="32-bit Capture Select bit" mask="0x00000100" name="C32" values="IC16CON__C32" />
            <bitfield caption="First Capture Edge Select bit" mask="0x00000200" name="FEDGE" values="IC16CON__FEDGE" />
            <bitfield caption="Stop in Idle Control bit" mask="0x00002000" name="SIDL" values="IC16CON__SIDL" />
            <bitfield caption="Input Capture Module Enable bit" mask="0x00008000" name="ON" values="IC16CON__ON" />
         </register>
         <register caption="" name="IC1BUF" offset="0x10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC1BUF" />
         </register>
         <register caption="" name="IC2BUF" offset="0x210" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC2BUF" />
         </register>
         <register caption="" name="IC3BUF" offset="0x410" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC3BUF" />
         </register>
         <register caption="" name="IC4BUF" offset="0x610" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC4BUF" />
         </register>
         <register caption="" name="IC5BUF" offset="0x810" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC5BUF" />
         </register>
         <register caption="" name="IC6BUF" offset="0xa10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC6BUF" />
         </register>
         <register caption="" name="IC7BUF" offset="0xc10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC7BUF" />
         </register>
         <register caption="" name="IC8BUF" offset="0xe10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC8BUF" />
         </register>
         <register caption="" name="IC9BUF" offset="0x1010" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC9BUF" />
         </register>
         <register caption="" name="IC10BUF" offset="0x21210" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC10BUF" />
         </register>
         <register caption="" name="IC11BUF" offset="0x21410" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC11BUF" />
         </register>
         <register caption="" name="IC12BUF" offset="0x21610" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC12BUF" />
         </register>
         <register caption="" name="IC13BUF" offset="0x21810" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC13BUF" />
         </register>
         <register caption="" name="IC14BUF" offset="0x21a10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC14BUF" />
         </register>
         <register caption="" name="IC15BUF" offset="0x21c10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC15BUF" />
         </register>
         <register caption="" name="IC16BUF" offset="0x21e10" rw="R" size="4">
            <bitfield mask="0xFFFFFFFF" name="IC16BUF" />
         </register>
      </register-group>
      <value-group caption="Input Capture Mode Select bits" name="IC1CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC1CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC1CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1" />
         <value caption="No input capture overflow is occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt Control bits" name="IC1CON__ICI">
         <value caption="Interrupt on every fourth capture event" name="" value="0x3"/>
         <value caption="Interrupt on every third capture event" name="" value="0x2"/>
         <value caption="Interrupt on every second capture event" name="" value="0x1"/>
         <value caption="Interrupt on every capture event" name="" value="0x0"/>
      </value-group>
      <value-group caption="Timer Select bit" name="IC1CON__ICTMR">
         <value caption="Timery is the counter source for capture" name="" value="0x0" />
         <value caption="Timerx is the counter source for capture" name="" value="0x1" />
      </value-group>
      <value-group caption="32-bit Capture Select bit" name="IC1CON__C32">
         <value caption="32-bit timer resource capture" name="" value="0x1" />
         <value caption="16-bit timer resource capture" name="" value="0x0" />
      </value-group>
      <value-group caption="First Capture Edge Select bit" name="IC1CON__FEDGE">
         <value caption="Capture rising edge first" name="" value="0x1" />
         <value caption="Capture falling edge first" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Control bit" name="IC1CON__SIDL">
         <value caption="Halt in CPU Idle mode" name="" value="0x1" />
         <value caption="Continue to operate in CPU Idle mode" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Module Enable bit" name="IC1CON__ON">
         <value caption="Module is enabled" name="" value="0x1" />
         <value caption="Disable and reset module" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Mode Select bits" name="IC2CON__ICM">
         <value caption="Interrupt-Only mode (only supported while in Sleep mode or Idle mode)" name="" value="0x7" />
         <value caption="Simple Capture Event mode every edge" name="" value="0x6" />
         <value caption="Prescaled Capture Event mode every sixteenth rising edge" name="" value="0x5" />
         <value caption="Prescaled Capture Event mode every fourth rising edge" name="" value="0x4" />
         <value caption="Simple Capture Event mode every rising edge" name="" value="0x3" />
         <value caption="Simple Capture Event mode every falling edge" name="" value="0x2" />
         <value caption="Edge Detect mode every edge (rising and falling)" name="" value="0x1" />
         <value caption="Input Capture module is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Buffer Not Empty Status bit" name="IC2CON__ICBNE">
         <value caption="Input capture buffer is not empty; at least one more capture value can be read" name="" value="0x1" />
         <value caption="Input capture buffer is empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Input Capture Overflow Status Flag bit" name="IC2CON__ICOV">
         <value caption="Input capture overflow is occurred" name="" value="0x1" />
         <value caption="No input capture overflow is occurred" name="" value="0x0" />
      </value-group>
