Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK0512GPD100.atdf
      <value-group caption="Interrupt with Priority Level 1 Shadow Set bits" name="PRISS__PRI1SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 1 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 2 Shadow Set bits" name="PRISS__PRI2SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 2 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 3 Shadow Set bits" name="PRISS__PRI3SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 3 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 4 Shadow Set bits" name="PRISS__PRI4SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 4 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 5 Shadow Set bits" name="PRISS__PRI5SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 5 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
      <value-group caption="Interrupt with Priority Level 6 Shadow Set bits" name="PRISS__PRI6SS">
         <value caption="Reserved" name="" value="0xf" />
         <value caption="Reserved" name="" value="0xe" />
         <value caption="Reserved" name="" value="0xd" />
         <value caption="Reserved" name="" value="0xc" />
         <value caption="Reserved" name="" value="0xb" />
         <value caption="Reserved" name="" value="0xa" />
         <value caption="Reserved" name="" value="0x9" />
         <value caption="Reserved" name="" value="0x8" />
         <value caption="Reserved" name="" value="0x7" />
         <value caption="Reserved" name="" value="0x6" />
         <value caption="Reserved" name="" value="0x5" />
         <value caption="Reserved" name="" value="0x4" />
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 1" name="" value="0x1" />
         <value caption="Interrupt with a priority level of 6 uses Shadow Set 0 (default)" name="" value="0x0" />
      </value-group>
