Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK0512GPD100.atdf
      <value-group caption="Group2 Read Permissions bits" name="SBT2RD1__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT2RD1__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT2RD2__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT2RD2__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT2RD2__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT2RD2__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT3RD0__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT3RD0__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT3RD0__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT3RD0__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT3RD1__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT3RD1__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT3RD1__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT3RD1__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group0 Read Permissions bits" name="SBT3RD2__GROUP0">
         <value caption="Privilege Group 0 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group1 Read Permissions bits" name="SBT3RD2__GROUP1">
         <value caption="Privilege Group 1 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group2 Read Permissions bits" name="SBT3RD2__GROUP2">
         <value caption="Privilege Group 2 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group3 Read Permissions bits" name="SBT3RD2__GROUP3">
         <value caption="Privilege Group 3 has read permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have read permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT0WR0__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT0WR0__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT0WR0__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT0WR0__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 0 Write Permissions bits" name="SBT0WR1__GROUP0">
         <value caption="Privilege Group 0 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 0 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 1 Write Permissions bits" name="SBT0WR1__GROUP1">
         <value caption="Privilege Group 1 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 1 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 2 Write Permissions bits" name="SBT0WR1__GROUP2">
         <value caption="Privilege Group 2 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 2 does not have write permission" name="" value="0x0" />
      </value-group>
      <value-group caption="Group 3 Write Permissions bits" name="SBT0WR1__GROUP3">
         <value caption="Privilege Group 3 has write permission" name="" value="0x1" />
         <value caption="Privilege Group 3 does not have write permission" name="" value="0x0" />
      </value-group>
