Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/atdf/PIC32MK0512GPD100.atdf
      <value-group caption="Enable Interrupt Events via FRMERR bit" name="SPI6CON2__FRMERREN">
         <value caption="Frame Error overflow generates error events" name="" value="0x1"/>
         <value caption="Frame Error does not generate error events" name="" value="0x0"/>
      </value-group>
      <value-group caption="Sign Extend Read Data from the RX FIFO bit" name="SPI6CON2__SPISGNEXT">
         <value caption="Data from RX FIFO is sign extended" name="" value="0x1"/>
         <value caption="Data from RX FIFO is not sign extened" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="02141" name="TMR1" version="2">
      <register-group name="TMR1">
         <register caption="TYPE A TIMER CONTROL REGISTER" name="T1CON" offset="0x0" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T1CON__TCS" />
            <bitfield caption="Timer External Clock Input Synchronization Selection bit" mask="0x00000004" name="TSYNC" values="T1CON__TSYNC" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000030" name="TCKPS" values="T1CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T1CON__TGATE" />
            <bitfield caption="Timer1 External Clock Selection bits" mask="0x00000300" name="TECS" values="T1CON__TECS" />
            <bitfield caption="Asynchronous Timer Write in Progress bit" mask="0x00000800" name="TWIP" values="T1CON__TWIP" />
            <bitfield caption="Asynchronous Timer Write Disable bit" mask="0x00001000" name="TWDIS" values="T1CON__TWDIS" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T1CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T1CON__ON" />
         </register>
         <register caption="" name="TMR1" offset="0x10" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="TMR1" />
         </register>
         <register caption="" name="PR1" offset="0x20" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="PR1" />
         </register>
      </register-group>
      <value-group caption="Timer Clock Source Select bit" name="T1CON__TCS">
         <value caption="External clock is defined by the TECS bits" name="" value="0x1" />
         <value caption="Internal peripheral clock" name="INT_CLK" value="0x0" />
      </value-group>
      <value-group caption="Timer External Clock Input Synchronization Selection bit" name="T1CON__TSYNC">
         <value caption="(When TCS is 1) External clock input is synchronized / (When TCS is 0) This bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 1) External clock input is not synchronized / (When TCS is 0) This bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Input Clock Prescale Select bits" name="T1CON__TCKPS">
         <value caption="1:256 prescale value" name="" value="0x3" />
         <value caption="1:64 prescale value" name="" value="0x2" />
         <value caption="1:8 prescale value" name="" value="0x1" />
         <value caption="1:1 prescale value" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer Gated Time Accumulation Enable bit" name="T1CON__TGATE">
         <value caption="(When TCS is 0) Gated time accumulation is enabled / (When TCS is 1) bit is ignored" name="" value="0x1" />
         <value caption="(When TCS is 0) Gated time accumulation is disabled / (When TCS is 1) bit is ignored" name="" value="0x0" />
      </value-group>
      <value-group caption="Timer1 External Clock Selection bits" name="T1CON__TECS">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="External clock comes from the LPRC" name="" value="0x2" />
         <value caption="External clock comes from the T1CK pin" name="" value="0x1" />
         <value caption="External clock comes from the SOSC" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write in Progress bit" name="T1CON__TWIP">
         <value caption="(In Asynchronous Timer mode) Asynchronous write to TMR1 register in progress / (In Synchronous Timer mode)bit is read as 0" name="" value="0x1" />
         <value caption="In Asynchronous Timer mode Asynchronous write to TMR1 register complete / (In Synchronous Timer mode)bit is read as 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Asynchronous Timer Write Disable bit" name="T1CON__TWDIS">
         <value caption="Writes to TMR1 are ignored until pending write operation completes" name="" value="0x1" />
         <value caption="Back-to-back writes are enabled (Legacy Asynchronous Timer functionality)" name="" value="0x0" />
      </value-group>
      <value-group caption="Stop in Idle Mode bit" name="T1CON__SIDL">
         <value caption="Discontinue operation when device enters Idle mode" name="" value="0x1" />
         <value caption="Continue operation even in Idle mode" name="CONTINUE" value="0x0" />
      </value-group>
      <value-group caption="Timer On bit" name="T1CON__ON">
         <value caption="Timer is enabled" name="" value="0x1" />
         <value caption="Timer is disabled" name="" value="0x0" />
      </value-group>
   </module>
   <module caption="" id="02815" name="TMR" version="1">
      <register-group name="TMR">
         <register caption="Timer Configuration" name="T2CON" offset="0x200" rw="RW" size="4">
            <bitfield caption="Timer Clock Source Select bit" mask="0x00000002" name="TCS" values="T2CON__TCS" />
            <bitfield caption="32-Bit Timer Mode Select bit" mask="0x00000008" name="T32" values="T2CON__T32" />
            <bitfield caption="Timer Input Clock Prescale Select bits" mask="0x00000070" name="TCKPS" values="T2CON__TCKPS" />
            <bitfield caption="Timer Gated Time Accumulation Enable bit" mask="0x00000080" name="TGATE" values="T2CON__TGATE" />
            <bitfield caption="Synchronized Timer Start/Stop Enable bit" mask="0x00000100" name="SYNC" values="T2CON__SYNC" />
            <bitfield caption="Stop in Idle Mode bit" mask="0x00002000" name="SIDL" values="T2CON__SIDL" />
            <bitfield caption="Timer On bit" mask="0x00008000" name="ON" values="T2CON__ON" />
         </register>
